Autodesk.Revit.DB.LayoutRuleFixedDistance.JustifyType
Get or set the type of justification.
Remarks: The justifyType passed in must be a valid object.

Autodesk.Revit.DB.LayoutRuleFixedDistance.Spacing
Get or set spacing of the Beam System.
Remarks: The value of spacing must be between 0 and 30000.

Autodesk.Revit.DB.LayoutRuleFixedDistance.#ctor(System.Double,Autodesk.Revit.DB.BeamSystemJustifyType)
Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
spacing:  The value of spacing must be between 0 and 30000.
justifyType:  The type of the justification, it's corresponding to the items in the element properties dialog.

Autodesk.Revit.DB.LayoutRuleFixedDistance
This class indicate the layout rule of a Beam System is Fixed-Distance.
Remarks: To use this type of LayoutRule, the distance between the beams and the justify-type must be set.